In [1]:
import pandas as pd
import matplotlib.pyplot as plt
from datasets import load_dataset

#loading data
dataset = load_dataset('coachprerakmehta/data_jobs')
df = dataset['train'].to_pandas()

#data cleaning
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

In [2]:
df['salary_year_avg']

0        NaN
1        NaN
2        NaN
3        NaN
4        NaN
          ..
785736   NaN
785737   NaN
785738   NaN
785739   NaN
785740   NaN
Name: salary_year_avg, Length: 785741, dtype: float64

In [10]:
df[pd.notna(df['salary_year_avg'])]['salary_year_avg']       #displays only one column that is salary_year_avg 
df_salary = df[pd.notna(df['salary_year_avg'])].copy()

In [16]:
#calculating inflated salary by defining a function
def projected_salary(salary):
    return salary * 1.07

df_salary['salary_year_inflated'] = df_salary['salary_year_avg'].apply(projected_salary)
df_salary[['salary_year_avg', 'salary_year_inflated']]

        salary_year_avg  salary_year_inflated
28             109500.0             117165.00
77             140000.0             149800.00
92             120000.0             128400.00
100            228222.0             244197.54
109             89000.0              95230.00
...                 ...                   ...
785624         139216.0             148961.12
785641         150000.0             160500.00
785648         221875.0             237406.25
785682         157500.0             168525.00
785692         157500.0             168525.00

[22003 rows x 2 columns]

In [15]:
#calculating inflated salary using lambda function
df_salary['salary_year_inflated'] = df_salary['salary_year_avg'].apply(lambda salary: salary * 1.07)
df_salary[['salary_year_avg', 'salary_year_inflated']]

        salary_year_avg  salary_year_inflated
28             109500.0             117165.00
77             140000.0             149800.00
92             120000.0             128400.00
100            228222.0             244197.54
109             89000.0              95230.00
...                 ...                   ...
785624         139216.0             148961.12
785641         150000.0             160500.00
785648         221875.0             237406.25
785682         157500.0             168525.00
785692         157500.0             168525.00

[22003 rows x 2 columns]

In [18]:
type(df['job_skills'][1])

str

In [20]:
import ast
ast.literal_eval(df['job_skills'][1])

['r', 'python', 'sql', 'nosql', 'power bi', 'tableau']

In [22]:
#df['job_skills'] = ast.literal_eval(df['job_skills'])   #it returns value error because we have to use apply function here.

In [24]:
def clean_list(skill_list):
    if pd.notna(skill_list):
        return ast.literal_eval(skill_list)
    
df['job_skills'] = df['job_skills'].apply(clean_list)

In [26]:
type(df['job_skills'][1])

list

In [ ]:
#using lambda function
df['job_skills'] = df['job_skills'].apply(lambda skill_list: ast.literal_eval(skill_list) if isinstance(skill_list, str) and pd.notna(skill_list) else skill_list)

#isinstance(skill_list, str) - Checks if the value is a string.
#pd.notna(skill_list) - Ensures the value is not NaN

In [33]:
#Senior roles hike = 1.1
#Others hike = 1.07

def projected_salary(row):
    if "Senior" in row['job_title_short']:
        return 1.1 * row['salary_year_avg']
    else:
        return 1.07 * row['salary_year_avg']
df_salary['salary_year_inflated'] = df_salary.apply(projected_salary, axis=1)

df_salary[['job_title_short', 'salary_year_avg', 'salary_year_inflated']]

       job_title_short  salary_year_avg  salary_year_inflated
28      Data Scientist         109500.0             117165.00
77       Data Engineer         140000.0             149800.00
92       Data Engineer         120000.0             128400.00
100     Data Scientist         228222.0             244197.54
109       Data Analyst          89000.0              95230.00
...                ...              ...                   ...
785624   Data Engineer         139216.0             148961.12
785641   Data Engineer         150000.0             160500.00
785648  Data Scientist         221875.0             237406.25
785682  Data Scientist         157500.0             168525.00
785692  Data Scientist         157500.0             168525.00

[22003 rows x 3 columns]